;; -*- no-byte-compile: t; -*-
;;; packages.el

(package! beacon)
(package! catppuccin-theme)
;; (package! expand-region)
(package! git-timemachine)
;; (package! mmm-mode)
(package! modus-themes)
(package! ob-tmux)
(package! pcre2el)                      ; https://github.com/joddie/pcre2el
(package! pkl-mode)                     ; https://github.com/sin-ack/pkl-mode
;; (package! puppet-mode)
(package! rainbow-delimiters)
;; (package! sway)
(package! systemd-mode)
(package! writeroom-mode)
(package! eldoc-box)
;; (package! origami)
